Repository: DEAN-ngo/elimupi
Catalog: ansible/roles/common/files/html/translations/*/LC_MESSAGES/messages.po
Languages: sw_ke

source: %1$s has been converted to %2$s. Account created succesfully.
sw_ke: %1$s imebadilishwa kuwa %2$s. Akaunti imeundwa

source: (Max %1$s)
sw_ke: (Upeo %1$s)

source: Account for %1$s already exists.
sw_ke: Akaunti ya %1$s tayari ipo .

source: Account for %1$s has been created successfully.
sw_ke: Akaunti ya %1$s imeundwa.

source: Add a user
sw_ke: Ongeza mtumiaji

source: Add user
sw_ke: Ongeza mtumiaji

source: Add users
sw_ke: Ongeza watumiaji

source: Added:
sw_ke: Ameongezwa:

source: Admin
sw_ke: Msimamizi

source: An offline educational server solution
sw_ke: Suluhisho la seva ya elimu ya nje ya mtandao

source: Android Apps
sw_ke: Programu za Android

source: Backup accounts
sw_ke: Akaunti ya chelezo

source: Bandwidth rates apply when connecting to an online resource.
sw_ke: Viwango vya kipimo data hutumika wakati wa kuuanganisha kwa rasilimali ya mtandaoni.

source: Change password
sw_ke: Badilisha nywila

source: Click <em>+ new repository</em>
sw_ke: Bofya <em>+ hazina mpya</em>

source: Coming soon: electronic learning environment for teachers
sw_ke: Inakuja hivi karibuni: mazingira ya kielektroniki ya kujifunzia kwa walimu

source: Content
sw_ke: Nyenzo

source: Copied :
sw_ke: Kunakiliwa :

source: Copy packages
sw_ke: Nakala vifurushi

source: Copy packages to secondary disk
sw_ke: Nakili vifurushi kwenye diski ya sekondari

source: Copying packages.
sw_ke: Kuiga vifurushi.

source: Create Content Disk
sw_ke: Tengeneza diski ya yaliyomo

source: Create and delete pupils with a text file
sw_ke: Unda na ufute wanafunzi kwa faili ya maandishi

source: Curriculum content
sw_ke: Nyenzo za mtaala

source: DEAN - ElimuPi - Elimu Online
sw_ke: DEAN - ElimuPi Mtandaoni

source: Disk usage :
sw_ke: Matumizi ya diski :

source: Documents
sw_ke: Waraka

source: Done updating.
sw_ke: Kumaliza kusasisha.

source: Download
sw_ke: Pakua

source: Download fdroid.apk to your device.
sw_ke: Pakua fdroid.apk kwenye kifaa chako.

source: Download log files
sw_ke: Pakua faili za kumbukumbu

source: Educational Materials
sw_ke: Nyenzo za Elimu

source: Educational documents
sw_ke: Nyaraka za elimu

source: Eject
sw_ke: Toa

source: ElimuGo app
sw_ke: Programu ya ElimuGo

source: ElimuOnline is a Learn Management System (LMS) where we share educational content for the Kenyan national curriculum.
sw_ke: Elimu Mtandaoni ni Mfumo wa Usimamizi wa Kujifunza (LMS) ambapo tunashiriki nyenzo za elimu kwa mtaala wa kitaifa wa Kenya.

source: ElimuPi Online
sw_ke: ElimuPi Mtandaoni

source: ElimuPi disk not available.
sw_ke: Diski ya ElimuPi haipatikani.

source: Elimupi Admin
sw_ke: Msimamizi wa ElimuPi

source: Email
sw_ke: Barua pepe

source: Enter <strong>http://fdroid.local</strong> and <i>add</i>
sw_ke: Ingiza <strong>http://fdroid.local</strong> and <i>add</i>

source: Fetch all
sw_ke: Leta zote

source: Fetching packages info.
sw_ke: Kuleta habari za vifurushi.

source: Find information in this vast encyclopedia
sw_ke: Tafuta habari katika ensaiklopidia hii kubwa

source: Generate
sw_ke: Tengeneza

source: Go Back and click on <em>categories</em> to view the available apps
sw_ke: Rudi nyuma na ubofye <em>kategoria</em> kutazama programu zinazopatikana

source: Go to <em>Repositories</em>
sw_ke: Enda kwa<em>hazina</em>

source: Go to <em>settings</em>
sw_ke: Enda Kwa <em>mipangilio</em>

source: Good to know
sw_ke: Vizuri kujua

source: Home
sw_ke: Nyumbani

source: How to distribute Android apps?
sw_ke: Jinsi ya kusambaza programu za Android?

source: In case you get a warning about "unknown sources", allow the installation from unknow sources.
sw_ke: Ikiwa utapata onyo kuhusu "vyanzo visivyojulikana", ruhusu usakinishaji kutoka kwa vyanzo visivyojulikana.

source: In the Admin interface a text file can be selected to synchronize the accounts of all pupils. The text file should contain a username on each line and can be a CSV file in which the lines end with one or more commas. All spaces will be removed. If the username doesn't exist yet it is created. If the username doesn't exist in the file and if the account has been created before it is deleted. The synchronize functionality doesn't start when 25% or more of all accounts would be deleted by the action.
sw_ke: Katika kiolesura cha Admin, faili ya maandishi inaweza kuchaguliwa ili kusawazisha akaunti za wanafunzi wote. Faili ya maandishi inapaswa kuwa na jina la mtumiaji kwenye kila mstari na inaweza kuwa faili ya CSV. ambamo mistari inaisha kwa koma moja au zaidi. Nafasi zote zitaondolewa. Ikiwa jina la mtumiaji halipo bado limeundwa. Ikiwa jina la mtumiaji halipo kwenye faili na ikiwa akauntiimeundwa kabla ya kufutwa. Utendaji wa kusawazisha hauanzi wakati 25% au zaidi ya akaunti zote zitafutwa na kitendo.

source: Initial password
sw_ke: Nywila ya awali

source: Install again
sw_ke: Sakinisha tena

source: Install fdroid.apk from your download folder by clicking it in a file manager on your device. (opening it direct from the download folder results in a "cannot open file". Use a file manager instead.)
sw_ke: Sakinisha fdroid.apk kutoka kwa folda yako ya upakuaji kwa kubofya kwenye kidhibiti faili kwenye kifaa chako. (kuifungua moja kwa moja kutoka kwa folda ya upakuaji husababisha "faili haiwezi kufungua". Tumia kidhibiti faili badala yake.)

source: Install password plugin
sw_ke: Sakinisha programu-jalizi ya nenosiri

source: Installed :
sw_ke: Imesakinishwa:

source: Installed versions
sw_ke: Matoleo yaliyosakinishwa

source: Installing :
sw_ke: Kusakinisha:

source: Installing packages
sw_ke: Kusakinisha vifurushi

source: Interactive educational resources per curriculum subject
sw_ke: Nyenzo shirikishi za elimu kwa kila somo la mtaala

source: Internal storage :
sw_ke: Uhifadhi wa ndani:

source: Khan Academy
sw_ke: Chuo cha Khan

source: List users
sw_ke: Orodha ya watumiaji

source: Local package
sw_ke: Kifurushi cha ndani

source: Local packages list is not readable.
sw_ke: Orodha ya vifurushi vya ndani haisomeki.

source: Log off
sw_ke: Ondoka

source: Login
sw_ke: Ingia

source: Login form
sw_ke: Fomu ya kuingia

source: Login not correct. Try again.
sw_ke: Kuingia sio sahihi. Jaribu tena.

source: Looking for sources
sw_ke: Kutafuta vyanzo

source: Lost a password
sw_ke: Umepoteza nenosiri

source: Material
sw_ke: Nyenzo

source: Moodle password plugin
sw_ke: Programu-jalizi ya nenosiri la Moodle

source: New :
sw_ke: Mpya :

source: New password
sw_ke: Nywila mpya

source: No local packages found
sw_ke: Hakuna vifurushi vya ndani vilivyopatikana

source: No removal done.
sw_ke: Hakuna uondoaji uliofanyika.

source: Nothing added.
sw_ke: Hakuna kilichoongezwa.

source: Nothing found.
sw_ke: Hakuna kilichopatikana.

source: OK
sw_ke: Sawa

source: Password is like the old one.
sw_ke: Nywila ni kama ile ya zamani.

source: Password is the same.
sw_ke: Nywila inafanana.

source: Password is too short.
sw_ke: Nywila ni fupi sana.

source: Password is too similar.
sw_ke: Nywila inafanana sana.

source: Password is unchanged.
sw_ke: Nywila haijabadilishwa.

source: Password updated successfully.
sw_ke: Nywila imesasishwa kwa mafanikio.

source: Read
sw_ke: Soma

source: Refresh
sw_ke: Onyesha upya

source: Remove students not in the file :
sw_ke: Ondoa wanafunzi wasio kwenye faili :

source: Removed :
sw_ke: Ondolewa :

source: Restart
sw_ke: Anzisha tena

source: Search package
sw_ke: Tafuta kifurushi

source: Secondary Disk
sw_ke: Diski ya Sekondari

source: Share
sw_ke: Shiriki

source: Something went wrong.
sw_ke: Hitilafu fulani imetokea.

source: Start Fdroid, an empty screen will appear
sw_ke: Anzisha Fdroid, skrini tupu itaonekana

source: Start adding students.
sw_ke: Anza kuongeza wanafunzi.

source: Start syncing students.
sw_ke: Anza kusawazisha wanafunzi.

source: Storage
sw_ke: Hifadhi

source: Student
sw_ke: Mwanafunzi

source: Stuff
sw_ke: Vitu

source: Submit
sw_ke: Wasilisha

source: Support
sw_ke: Msaada

source: Sync
sw_ke: Kusawazisha

source: Teacher
sw_ke: Mwalimu

source: Telephone
sw_ke: Simu

source: The ElimuPi
sw_ke: Elimupi

source: The ElimuPi contains a range of educational Android apps. These apps can be installed on Android devices (tablets/phones) without the need of an internet connection.
sw_ke: ElimuPi ina programu mbalimbali za Android za elimu. Programu hizi zinaweza kusakinishwa kwenye vifaa vya Android (kompyuta kibao/simu) bila kuhitaji la mtandao wa intaneti.

source: The ElimuPi containts a wide range of educational resources. These resources are made available by creating a wireless access point. Since you are reading this, you were able to connect to the elimu Wi-Fi network.
sw_ke: ElimuPi ina nyenzo nyingi za elimu. Nyenzo hizi zinapatikana kwa kuunda sehemu ya kufikia bila waya. Kwa kuwa unasoma hii, uliweza kuunganisha kwenye mtandao wa elimu Wi-Fi.

source: The ElimuPi is developed by Digital Education Africa Network (DEAN). In case you need support, have wishes for additional functionality, or want to report a bug. Please feel free to contact us.
sw_ke: ElimuPi imetengenezwa na Digital Education Africa Network (DEAN) Ikiwa unahitaji usaidizi, kuwa na matakwa ya utendaji wa ziada, au unataka kuripoti kosa. Tafadhali jisikie huru kuwasiliana nasi.

source: The curriculum content on the elimuPi comes from different educational publishers. We have organised this content by the national curriculum subjects of Kenya. Each subject contains different sources on different levels which complement and enrich the existing teaching methods.
sw_ke: Nyenzo za mtaala kwenye elimuPi yanatoka kwa wachapishaji tofauti wa elimu. Tumepanga nyenzo hizi kulingana na masomo ya mtaala wa kitaifa wa Kenya. Kila somo lina vyanzo tofauti katika viwango tofauti ambavyo vinakamilisha na kuboresha mbinu zilizopo za ufundishaji.

source: The new password is too simple.
sw_ke: Nywila mpya ni rahisi sana.

source: Title
sw_ke: Kichwa

source: Total used of
sw_ke: Jumla ya iliyotumiwa

source: Try again.
sw_ke: Jaribu tena.

source: Turn off
sw_ke: Zima

source: Updates :
sw_ke: Sasisho :

source: Upload content
sw_ke: Pakia nyenzo

source: Upload students
sw_ke: Pakia wanafunzi

source: Users
sw_ke: Watumiaji

source: Verified :
sw_ke: Imethibitishwa :

source: Verifying packages.
sw_ke: Thibitisha vifurushi.

source: View account
sw_ke: Tazama akaunti

source: Website
sw_ke: Tovuti

source: Welcome to the ElimuPi; the largest offline resource for education.
sw_ke: Karibu katika ElimuPi; rasilimali kubwa zaidi ya nje ya mtandao kwa elimu.

source: What are the requirements of the file?
sw_ke: Mahitaji ya faili ni nini?

source: Wikipedia is a free, open content online encyclopedia created through the collaborative effort of a community of users. The version on the ElimuPi is accessible without the need of having internet access.
sw_ke: Wikipedia ni ensaiklopidia isiyolipishwa nyenzo za mtandaoni iliyoundwa kupitia juhudi za ushirikiano za jumuiya ya watumiaji. Toleo la ElimuPi inaweza kupatikana bila kuhitaji kuwa na ufikiaji wa mtandao.

source: account
sw_ke: akaunti

source: day ago
sw_ke: siku iliyopita

source: days ago
sw_ke: siku zilizopita

source: enter password
sw_ke: ingiza nywila

source: enter password again
sw_ke: ingiza nywila tena

source: month ago
sw_ke: mwezi uliopita

source: months ago
sw_ke: miezi iliyopita

source: name
sw_ke: jina

source: new password
sw_ke: nywila mpya

source: new password again
sw_ke: nywila mpya tena

source: password
sw_ke: nywila

source: search
sw_ke: tafuta

source: today
sw_ke: leo

source: turn off
sw_ke: zima

source: turn off ElimuPi
sw_ke: Zima ElimuPi.

source: week ago
sw_ke: wiki iliyopita

source: weeks ago
sw_ke: wiki zilizopita

source: year ago
sw_ke: mwaka uliopita

source: years ago
sw_ke: miaka iliyopita
